In [59]:
# Add Matplotlib inline magic command
%matplotlib inline
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd
import os

In [60]:
# Files to load
city_data_to_load = "Resources/city_data.csv"
ride_data_to_load = "Resources/ride_data.csv"

In [61]:
# Read the city data file and store it in a pandas DataFrame.
city_data_df = pd.read_csv(city_data_to_load)
city_data_df.head(10)

            city  driver_count   type
0    Richardfort            38  Urban
1   Williamsstad            59  Urban
2    Port Angela            67  Urban
3     Rodneyfort            34  Urban
4    West Robert            39  Urban
5   West Anthony            70  Urban
6    West Angela            48  Urban
7  Martinezhaven            25  Urban
8      Karenberg            22  Urban
9    Barajasview            26  Urban

In [62]:
# Read the ride data file and store it in a pandas dataframe
ride_data_df = pd.read_csv(ride_data_to_load)
ride_data_df

                    city           date   fare       ride_id
0     Lake Jonathanshire  1/14/19 10:14  13.83  5.739410e+12
1     South Michelleport   3/4/19 18:24  30.24  2.343910e+12
2     Port Samanthamouth   2/24/19 4:29  33.44  2.005070e+12
3             Rodneyfort  2/10/19 23:22  23.44  5.149250e+12
4             South Jack    3/6/19 4:28  34.58  3.908450e+12
...                  ...            ...    ...           ...
2370         Michaelberg  4/29/19 17:04  13.38  8.550370e+12
2371     Lake Latoyabury   1/30/19 0:05  20.76  9.018730e+12
2372         North Jaime  2/10/19 21:03  11.11  2.781340e+12
2373        West Heather   5/7/19 19:22  44.94  4.256850e+12
2374          Newtonview  4/25/19 10:20  55.84  9.990580e+12

[2375 rows x 4 columns]

In [64]:
# find particular value based on row
ride_data_df.iloc[1]['fare']

30.24

In [73]:
#passing_math_count = school_data_complete_df[(school_data_complete_df["math_score"] >= 70)]
#                    .count()["student_name"]


# find number of fares in Lake Jonathanshire that are greater than 20
jonathan_greater_than_ten = ride_data_df[(ride_data_df['city'] == 'Lake Jonathanshire') &
                           (ride_data_df['fare'] >= 10.00)].count()['fare']


jonathan_greater_than_ten

23

In [74]:
#just_THS_ninth = student_data_df.loc[(student_data_df["school_name"] == "Thomas High School") 
#                                     & (student_data_df["grade"] == "9th"),['Student ID']].count()

jonathan_greater_than_ten = ride_data_df.loc[(ride_data_df['city'] == 'Lake Jonathanshire') &
                           (ride_data_df['fare'] >= 10.00),['fare']].count()


jonathan_greater_than_ten

fare    23
dtype: int64

In [22]:
city_data_df.count()

city            120
driver_count    120
type            120
dtype: int64

In [23]:
city_data_df.isnull().sum()

city            0
driver_count    0
type            0
dtype: int64

In [24]:
ride_data_df.count()

city       2375
date       2375
fare       2375
ride_id    2375
dtype: int64

In [26]:
ride_data_df.isnull().sum()

city       0
date       0
fare       0
ride_id    0
dtype: int64

In [32]:
# Get the datatypes of each column in the ride data dataframe
ride_data_df.dtypes

city        object
date        object
fare       float64
ride_id    float64
dtype: object

In [33]:
# Get the datatypes for each column in the city data dataframe
city_data_df.dtypes

city            object
driver_count     int64
type            object
dtype: object

In [40]:
# Get the number of uniques for the city data columns
city_data_df['city'].nunique()

120

In [41]:
city_data_df['type'].nunique()

3

In [42]:
city_data_df['driver_count'].nunique()

52

In [43]:
# Get those actual unique values
city_data_df['type'].unique()

array(['Urban', 'Suburban', 'Rural'], dtype=object)

In [46]:
# Get the number of urban city values
sum(city_data_df['type'] == 'Urban')

66

In [82]:
sum(city_data_df['type'] == 'Suburban')

36

In [83]:
sum(city_data_df['type'] == 'Rural')

18

In [84]:
ride_data_df.dtypes

city        object
date        object
fare       float64
ride_id    float64
dtype: object

In [88]:
# Get the columns and the rows that are not null.
ride_data_df.isnull().sum()

city       0
date       0
fare       0
ride_id    0
dtype: int64

In [92]:
combined_df = pd.merge(ride_data_df, city_data_df, how='left', on=["city", "city"])

In [93]:
combined_df

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,1/14/19 10:14,13.83,5.739410e+12,5,Urban
1,South Michelleport,3/4/19 18:24,30.24,2.343910e+12,72,Urban
2,Port Samanthamouth,2/24/19 4:29,33.44,2.005070e+12,57,Urban
3,Rodneyfort,2/10/19 23:22,23.44,5.149250e+12,34,Urban
4,South Jack,3/6/19 4:28,34.58,3.908450e+12,46,Urban
...,...,...,...,...,...,...
2370,Michaelberg,4/29/19 17:04,13.38,8.550370e+12,6,Rural
2371,Lake Latoyabury,1/30/19 0:05,20.76,9.018730e+12,2,Rural
2372,North Jaime,2/10/19 21:03,11.11,2.781340e+12,1,Rural
2373,West Heather,5/7/19 19:22,44.94,4.256850e+12,4,Rural
2374,Newtonview,4/25/19 10:20,55.84,9.990580e+12,1,Rural

In [94]:
combined_df = combined_df[['city', 'driver_count', 'type', 'date', 'fare', 'ride_id']]
combined_df

,city,driver_count,type,date,fare,ride_id
0,Lake Jonathanshire,5,Urban,1/14/19 10:14,13.83,5.739410e+12
1,South Michelleport,72,Urban,3/4/19 18:24,30.24,2.343910e+12
2,Port Samanthamouth,57,Urban,2/24/19 4:29,33.44,2.005070e+12
3,Rodneyfort,34,Urban,2/10/19 23:22,23.44,5.149250e+12
4,South Jack,46,Urban,3/6/19 4:28,34.58,3.908450e+12
...,...,...,...,...,...,...
2370,Michaelberg,6,Rural,4/29/19 17:04,13.38,8.550370e+12
2371,Lake Latoyabury,2,Rural,1/30/19 0:05,20.76,9.018730e+12
2372,North Jaime,1,Rural,2/10/19 21:03,11.11,2.781340e+12
2373,West Heather,4,Rural,5/7/19 19:22,44.94,4.256850e+12
2374,Newtonview,1,Rural,4/25/19 10:20,55.84,9.990580e+12

In [95]:
combined_df.rename(columns = {'driver_count':'# drivers'})

                    city  # drivers   type           date   fare       ride_id
0     Lake Jonathanshire          5  Urban  1/14/19 10:14  13.83  5.739410e+12
1     South Michelleport         72  Urban   3/4/19 18:24  30.24  2.343910e+12
2     Port Samanthamouth         57  Urban   2/24/19 4:29  33.44  2.005070e+12
3             Rodneyfort         34  Urban  2/10/19 23:22  23.44  5.149250e+12
4             South Jack         46  Urban    3/6/19 4:28  34.58  3.908450e+12
...                  ...        ...    ...            ...    ...           ...
2370         Michaelberg          6  Rural  4/29/19 17:04  13.38  8.550370e+12
2371     Lake Latoyabury          2  Rural   1/30/19 0:05  20.76  9.018730e+12
2372         North Jaime          1  Rural  2/10/19 21:03  11.11  2.781340e+12
2373        West Heather          4  Rural   5/7/19 19:22  44.94  4.256850e+12
2374          Newtonview          1  Rural  4/25/19 10:20  55.84  9.990580e+12

[2375 rows x 6 columns]